// src/data/apartments.js
export const apartments = [
    {
        id: 1,
        name: "Aqua Vista",
        images: [
                "/images/1.jpg", "/images/2.jpg",
                "/images/3.jpg", "/images/4.jpg",
                "/images/5.jpg", "/images/6.jpg",
                "/images/7.jpg", "/images/8.jpg",
                "/images/9.jpg", "/images/10.jpg",
                "/images/11.jpg", "/images/12.jpg",],
        description: `
            <h4>על הוילה</h4>
            <p>
              וילה חדשה מהניילונים (2025) עם נוף מרהיב לים ולהרים – חופשה יוקרתית באווירה בלתי נשכחת.
              הוילה כוללת חצר רחבת ידיים, בריכה פרטית, חמישה חדרי שינה מרווחים וסלון מפנק המציע תחושת רוגע וזמן איכות יחד.
            </p>
            <p>
              במרחק הליכה מחוף מוש, ממסעדות, חיי הלילה והאטרקציות של אילת – כל מה שצריך לחופשה מושלמת ממש מחכה לכם מעבר לפינה.
            </p>
            <p><em>*קיים מרחב מוגן</em></p>
        
            <h4>מתחם הפנים</h4>
            <ul>
              <li>4 חדרי שינה עם מיטה זוגית, 3 מיטות יחיד, טלוויזיה.</li>
              <li>חדר מאסטר עם מיטה זוגית, טלוויזיה וחדר רחצה פרטי.</li>
              <li>3 חדרי שירותים ו־2 חדרי רחצה עם מגבות.</li>
              <li>מטבח מאובזר, סלון מפנק ועוד.</li>
            </ul>
        
            <h4>מתחם החוץ</h4>
            <ul>
              <li>חצר גדולה בגודל 325 מ"ר.</li>
              <li>בריכה מגודרת.</li>
              <li>2 פינות ישיבה.</li>
              <li>שולחן אוכל נפתח עם 12 כיסאות.</li>
            </ul>
            
            <h4>עוד במקום</h4>
            <ul>
              <li>עבור הציבור הדתי ושומר המסורת: פלטת שבת, מיחם מים חמים ובית-כנסת במרחק הליכה.</li>
              <li>אטרקציות: שתי דקות מהחוף של מוש, טיילת, מרכזי קניות, מסעדות פאבים וספורט ימי.</li>
              <li>קיים מרחב מוגן.</li>
              <li>מכבדים הטבות מילואים.</li>
            </ul>   
          `,

        features: {
            general: ["מרחב מוגן" ,  "מבנה בנוי" ,  "פינת קפה" ,  "WIFI" ,  "מיזוג-אוויר" ,  "ברביקיו" ,
                "בר מים" ,  "מיטה זוגית" ,  "מזגן בכל חדר" , "אטרקציות" ,  "ניתן לבקש מזרנים נוספים" ,
                "5 חדרי שינה ומעלה" ,  "וילה ל-15 אנשים" ],
            units: ["Smart TV" , "טלוויזיה בכבלים/לווין" , "טלוויזיה בחדרי השינה" , "מטבח מאובזר"],
            outdoor: [ "בריכה פרטית ליחידה" , "מנגל" , "חצר/גינה" ,
                "פינות ישיבה" , "בריכה מגודרת ובטיחותית" , "מיטות שיזוף" ,
                "שולחן אוכל בחוץ" , "מדשאה רחבת ידיים" , "מאווררים בחוץ" , "תאורת לילה"],
            suitableFor: ["קבוצות" , "ציבור דתי" , "נופש" , "ימי גיבוש" , "מטיילים" , "משפחות"],
            nearby: ["חוף ים", "בית כנסת"],
            activities: [ "חדר כושר" , "מגרש טניס" , "מוזיאון" ,
                "טיולי אופניים" , "פינת ליטוף, פינת חי" , "גן שעשועים" ,
                "מסלולי טיול" , "טיולי גיפים" ,
                "טיולים מודרכים" , "שייט" , "מתקני ספורט" ]
        },

        capacity: 15,
        location: "הצלחה 1, אילת, 8800000",

    },
    {
        id: 2,
        name: "Aqua Sol",
        images: [
            "/images/1.jpg", "/images/2.jpg",
            "/images/3.jpg", "/images/4.jpg",
            "/images/5.jpg", "/images/6.jpg",
            "/images/7.jpg", "/images/8.jpg",
            "/images/9.jpg", "/images/10.jpg",
            "/images/11.jpg", "/images/12.jpg",],
        description: `
            <h4>על הדירה</h4>
            <p>חופשה מדהימה בפנטהאוז חלומי הכולל 4 חדרי שינה,
             אבזור יוקרתי ונוף יפהפה הפונה לעבר ים ומפרץ אילת, נוף שקשה להוריד ממנו את העיניים! האירוח מתאים לעד 12 נופשים.
                 <ul>
                    <li>בריכה גדולה.</li>
                    <li>חניה פרטית.</li>
                    <li style={{ fontWeight: "bold" }}>  שתי דקות נסיעה מהחוף של מוש ומחוף הדקל.</li>                 
                 </ul>
            </p>
            
        
        
        
        
        
        
        
        
        `,
        features: {
            general: ["מרחב מוגן" ,  "מבנה בנוי" ,  "פינת קפה" ,  "WIFI" ,  "מיזוג-אוויר" ,  "ברביקיו" ,
                "בר מים" ,  "מיטה זוגית" ,  "מזגן בכל חדר" , "אטרקציות" ,  "ניתן לבקש מזרנים נוספים" ,
                "5 חדרי שינה ומעלה" ,  "וילה ל-15 אנשים" ],
            units: ["Smart TV" , "טלוויזיה בכבלים/לווין" , "טלוויזיה בחדרי השינה" , "מטבח מאובזר"],
            outdoor: [ "בריכה פרטית ליחידה" , "מנגל" , "חצר/גינה" ,
                "פינות ישיבה" , "בריכה מגודרת ובטיחותית" , "מיטות שיזוף" ,
                "שולחן אוכל בחוץ" , "מדשאה רחבת ידיים" , "מאווררים בחוץ" , "תאורת לילה"],
            suitableFor: ["קבוצות" , "ציבור דתי" , "נופש" , "ימי גיבוש" , "מטיילים" , "משפחות"],
            nearby: ["חוף ים", "בית כנסת"],
            activities: [ "חדר כושר" , "מגרש טניס" , "מוזיאון" ,
                "טיולי אופניים" , "פינת ליטוף, פינת חי" , "גן שעשועים" ,
                "מסלולי טיול" , "טיולי גיפים" ,
                "טיולים מודרכים" , "שייט" , "מתקני ספורט" ]
        },
        capacity: 2,
        location: "Tel Aviv, Israel",

    },
    {
        id: 3,
        name: "פנינת הנוף",
        images: [
            "/images/1.jpg", "/images/2.jpg",
            "/images/3.jpg", "/images/4.jpg",
            "/images/5.jpg", "/images/6.jpg",
            "/images/7.jpg", "/images/8.jpg",
            "/images/9.jpg", "/images/10.jpg",
            "/images/11.jpg", "/images/12.jpg",],
        description: "דירה יוקרתית עם נוף פתוח...",

        features: {
            general: ["מרחב מוגן" ,  "מבנה בנוי" ,  "פינת קפה" ,  "WIFI" ,  "מיזוג-אוויר" ,  "ברביקיו" ,
                "בר מים" ,  "מיטה זוגית" ,  "מזגן בכל חדר" , "אטרקציות" ,  "ניתן לבקש מזרנים נוספים" ,
                "4 חדרי שינה ומעלה" ,  "וילה ל-15 אנשים" ],
            units: ["Smart TV" , "טלוויזיה בכבלים/לווין" , "טלוויזיה בחדרי השינה" , "מטבח מאובזר"],
            outdoor: [ "בריכה פרטית ליחידה" , "מנגל" , "חצר/גינה" ,
                "פינות ישיבה" , "בריכה מגודרת ובטיחותית" , "מיטות שיזוף" ,
                "שולחן אוכל בחוץ" , "מדשאה רחבת ידיים" , "מאווררים בחוץ" , "תאורת לילה"],
            suitableFor: ["קבוצות" , "ציבור דתי" , "נופש" , "ימי גיבוש" , "מטיילים" , "משפחות"],
            nearby: ["חוף ים", "בית כנסת"],
            activities: [ "חדר כושר" , "מגרש טניס" , "מוזיאון" ,
                "טיולי אופניים" , "פינת ליטוף, פינת חי" , "גן שעשועים" ,
                "מסלולי טיול" , "טיולי גיפים" ,
                "טיולים מודרכים" , "שייט" , "מתקני ספורט" ]
        },
        capacity: 3,
        location: "Tel Aviv, Israel",

    },
    {
        id: 4,
        name: "כליל הים",
        images: [
            "/images/1.jpg", "/images/2.jpg",
            "/images/3.jpg", "/images/4.jpg",
            "/images/5.jpg", "/images/6.jpg",
            "/images/7.jpg", "/images/8.jpg",
            "/images/9.jpg", "/images/10.jpg",
            "/images/11.jpg", "/images/12.jpg",],
        description: "דירה מרווחת ליד הים...",

        features: {
            general: ["מרחב מוגן" ,  "מבנה בנוי" ,  "פינת קפה" ,  "WIFI" ,  "מיזוג-אוויר" ,  "ברביקיו" ,
                "בר מים" ,  "מיטה זוגית" ,  "מזגן בכל חדר" , "אטרקציות" ,  "ניתן לבקש מזרנים נוספים" ,
                "4 חדרי שינה ומעלה" ,  "וילה ל-15 אנשים" ],
            units: ["Smart TV" , "טלוויזיה בכבלים/לווין" , "טלוויזיה בחדרי השינה" , "מטבח מאובזר"],
            outdoor: [ "בריכה פרטית ליחידה" , "מנגל" , "חצר/גינה" ,
                "פינות ישיבה" , "בריכה מגודרת ובטיחותית" , "מיטות שיזוף" ,
                "שולחן אוכל בחוץ" , "מדשאה רחבת ידיים" , "מאווררים בחוץ" , "תאורת לילה"],
            suitableFor: ["קבוצות" , "ציבור דתי" , "נופש" , "ימי גיבוש" , "מטיילים" , "משפחות"],
            nearby: ["חוף ים", "בית כנסת"],
            activities: [ "חדר כושר" , "מגרש טניס" , "מוזיאון" ,
                "טיולי אופניים" , "פינת ליטוף, פינת חי" , "גן שעשועים" ,
                "מסלולי טיול" , "טיולי גיפים" ,
                "טיולים מודרכים" , "שייט" , "מתקני ספורט" ]
        },
        capacity: 5,
        location: "Tel Aviv, Israel",

    },
    {
        id: 5,
        name: "קסם המפרץ",
        images: [
            "/images/1.jpg", "/images/2.jpg",
            "/images/3.jpg", "/images/4.jpg",
            "/images/5.jpg", "/images/6.jpg",
            "/images/7.jpg", "/images/8.jpg",
            "/images/9.jpg", "/images/10.jpg",
            "/images/11.jpg", "/images/12.jpg",],
        description: `
            <h4>על הדירה</h4>
            <p>חופשה מדהימה בפנטהאוז חלומי הכולל 4 חדרי שינה,
             אבזור יוקרתי ונוף יפהפה הפונה לעבר ים ומפרץ אילת, נוף שקשה להוריד ממנו את העיניים! האירוח מתאים לעד 12 נופשים.
                 <ul>
                    <li>בריכה גדולה.</li>
                    <li>חניה פרטית.</li>
                    <li> <strong> שתי דקות נסיעה מהחוף של מוש ומחוף הדקל.</strong></li>                 
                 </ul>
            </p>
            
            <h4>מתחם הפנים</h4>
            <ul>
              <li>4 חדרי שינה עם מיטה זוגית וטלוויזיה חכמה בחיבור כבלים (1 מהם הוא חדר מאסטר וב-1 אחר יש יציאה ישירה למרפסת).</li>
              <li>סלון עם ספות נפתחות וטלוויזיה חכמה בחיבור כבלים.</li>
              <li>3 מטבח המצויד בכיריים, מקרר, תנור, מיקרוגל, בר מים, מדיח, כלי מטבח ופינת קפה.</li>
              <li>פינת אוכל מרווחת.</li>
              <li>2 2 חדרי רחצה (1 מהם הוא בחדר מאסטר).</li>
              <li>מצעים נקיים ומלטפים.</li>
            </ul>
            
            <h4>מתחם החוץ</h4>
            <p>
            <strong>אל מול הנוף</strong><br>
            לפנטהאוז 2 מרפסות גדולות כאשר באחת מהן תמצאו בריכה גדולה ומקלחון כניסה, שולחן אוכל, מיטות שיזוף ופינות ישיבה.
            </p>
            
            <h4>לשומרי שבת</h4>
            <p>     
לנוחות הציבור הדתי במקום פלטה, מיחם ובית כנסת קרוב.            
            </p>
            
            <h4>מה בסביבה</h4>
            <p>
            <strong>אטרקציות בעיר השמש</strong><br>
         בקרבת מקום תוכלו לבקר בחוף של מוש, חוף הדקל, ריף הדולפינים, מועדוני צלילה, טיולי ג'יפים, טיולי טרקטורונים ומגוון מסעדות ומרכזי קניות.   
            </p>
            
            <h3>מכבדים הטבות למשרתי מילואים.</h3>
            
            <h4>הערות</h4>
            <p>לא ניתן לקיים אירועים ומסיבות במקום.</p>
            
            
            
        `,
        features: {
            general: ["מרחב מוגן" ,  "מבנה בנוי" ,  "פינת קפה" ,  "WIFI" ,  "מיזוג-אוויר" ,  "ברביקיו" ,
                "בר מים" ,  "מיטה זוגית" ,  "מזגן בכל חדר" , "אטרקציות" ,  "ניתן לבקש מזרנים נוספים" ,
                "4 חדרי שינה ומעלה" ,  "וילה ל-15 אנשים" ],
            units: ["Smart TV" , "טלוויזיה בכבלים/לווין" , "טלוויזיה בחדרי השינה" , "מטבח מאובזר"],
            outdoor: [ "בריכה פרטית ליחידה" , "מנגל" , "חצר/גינה" ,
                "פינות ישיבה" , "בריכה מגודרת ובטיחותית" , "מיטות שיזוף" ,
                "שולחן אוכל בחוץ" , "מדשאה רחבת ידיים" , "מאווררים בחוץ" , "תאורת לילה"],
            suitableFor: ["קבוצות" , "ציבור דתי" , "נופש" , "ימי גיבוש" , "מטיילים" , "משפחות"],
            nearby: ["חוף ים", "בית כנסת"],
            activities: [ "חדר כושר" , "מגרש טניס" , "מוזיאון" ,
                "טיולי אופניים" , "פינת ליטוף, פינת חי" , "גן שעשועים" ,
                "מסלולי טיול" , "טיולי גיפים" ,
                "טיולים מודרכים" , "שייט" , "מתקני ספורט" ]
        },
        capacity: 2,
        location: "Tel Aviv, Israel",

    },
];
